
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ПометкаУдаления Тогда
		АвтоматическоеПеремещениеИстекшихВКорзину = Константы.АвтоматическиПеремещатьИстекшиеТалоныВКорзину.Получить();
		ИстекСрокГарантии = (ДатаОкончанияГарантии < ТекущаяДатаСеанса());
		Если АвтоматическоеПеремещениеИстекшихВКорзину И ИстекСрокГарантии Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Невозможно записать изначально истекший талон'");
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И Не ЗначениеЗаполнено(ДатаПометкиУдаления) Тогда
		ДатаПометкиУдаления = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		ДатаПометкиУдаления = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
