
#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДействияПриЗапуске() Экспорт
	ВерсияДанных = Константы.ВерсияДанныхПриложения.Получить();
	Если ВерсияДанных = 0 Тогда
		ВыполнитьНачальноеЗаполнение();
		
		ВерсияДанных = АктуальнаяВерсияДанных();
		Константы.ВерсияДанныхПриложения.Установить(ВерсияДанных);
	КонецЕсли;
	
	Если ВерсияДанных < АктуальнаяВерсияДанных() Тогда
		ВыполнитьОбновлениеДанных();
	КонецЕсли;
	
	Справочники.ГарантийныеТалоны.ВыполнитьДействияПриЗапуске();
КонецПроцедуры

Функция АктуальнаяВерсияДанных()
	Возврат 1;
КонецФункции

Процедура ВыполнитьОбновлениеДанных()
	ВерсияДанных = Константы.ВерсияДанныхПриложения.Получить();
	
	// Оставляю пустым, далее здесь будут действия по обновлению данных
	
	Константы.ВерсияДанныхПриложения.Установить(ВерсияДанных);
КонецПроцедуры

Процедура ВыполнитьНачальноеЗаполнение()
	Константы.АвтоматическиПеремещатьИстекшиеТалоныВКорзину.ВыполнитьНачальноеЗаполнение();
	Константы.СрокХраненияТалоновВКорзине.ВыполнитьНачальноеЗаполнение();
КонецПроцедуры

#КонецОбласти
