
#Область СлужебныеПроцедурыИФункции

// Проверяет, что все символы строки присутствуют в переданном перечне допустимых символов
//
// Параметры:
//  Строка - Строка - Проверяемая строка
//  АлфавитДопустимыхСимволов - Строка - Строка, в которой перечислены все допустимые символы
// 
// Возвращаемое значение:
//  Булево - Строка не содержит недопустимых символов
Функция СтрокаСоответствуетАлфавиту(Строка, АлфавитДопустимыхСимволов) Экспорт
	ДопустимыеСимволы = Новый Массив;
	Для Сч = 1 По СтрДлина(АлфавитДопустимыхСимволов) Цикл
		Символ = ВРег(Сред(АлфавитДопустимыхСимволов, Сч, 1));
		ДопустимыеСимволы.Добавить(Символ);
	КонецЦикла;
	
	Для Сч = 1 По СтрДлина(Строка) Цикл
		Символ = ВРег(Сред(Строка, Сч, 1));
		Если ДопустимыеСимволы.Найти(Символ) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Проверяет, что ни один из символов строки не состоит в перечне запрещенных
//
// Параметры:
//  Строка - Строка - Проверяемая строка
//  АлфавитЗапрещенныхСимволов - Строка - Строка, в которой перечислены все недопустимые символы
// 
// Возвращаемое значение:
//  Булево - Строка не содержит недопустимых символов
Функция СтрокаНеСодержитЗапрещенныхСимволов(Строка, АлфавитЗапрещенныхСимволов) Экспорт
	ЗапрещенныеСимволы = Новый Массив;
	Для Сч = 1 По СтрДлина(АлфавитЗапрещенныхСимволов) Цикл
		Символ = ВРег(Сред(АлфавитЗапрещенныхСимволов, Сч, 1));
		ЗапрещенныеСимволы.Добавить(Символ);
	КонецЦикла;
	
	Для Сч = 1 По СтрДлина(Строка) Цикл
		Символ = ВРег(Сред(Строка, Сч, 1));
		Если ЗапрещенныеСимволы.Найти(Символ) <> Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция АлфавитРусскогоЯзыка() Экспорт
	Возврат "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
КонецФункции

Функция АлфавитАнглийскогоЯзыка() Экспорт
	Возврат "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
КонецФункции

#КонецОбласти
